app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`created_at`, `post_id`, `text`, `updated_at`) VALUES ('2014-02-09 05:14:29', 1, 'good', '2014-02-09 05:14:29')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    @comment.save