app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `text`, `title`, `updated_at`) VALUES ('2014-02-09 04:58:48', 'books', 'book', '2014-02-09 04:58:48')